---
kind: method
id: M:Autodesk.Revit.DB.GlobalParametersManager.Dispose
source: html/52902be7-4583-3216-3d62-79ed04326de2.htm
---
# Autodesk.Revit.DB.GlobalParametersManager.Dispose Method

Releases all resources used by the GlobalParametersManager

## Syntax (C#)
```csharp
public void Dispose()
```